package org.javaRoad.Lesson019_ObjectMethods.example;

/**
 Контракт equals() и hashCode()
 Эти два метода зачастую нужны вместе (например, во многих коллекциях), поэтому существует определенный
 контракт их взаимодействия:
 1. Переопределяя один метод, необходимо переопределить второй;
 2. Равенство объектов по equals() гарантирует равенство их хэшкодов;
 3. Равенство хэшкодов не гарантирует равенства объектов по equals().*

 *Последний пункт не очень удачен с точки зрения формулировки контракта, но распространен в сообществе. Его также можно
 заменить на: неравенство хэшкодов гарантирует неравенство объектов по equals().
 Именно для соблюдения контракта equals() и hashCode() возникает необходимость использовать при их переопределении
 одни и те же поля.
 */

public class Main {
    public static void main(String[] args) {
        // Тестирование переопределения hasCode()
        Person tom = new Person("Tom");
        System.out.println(tom.hashCode()); // 842740

        Person tomas = new Person("Tom");
        System.out.println(tomas.hashCode()); // 842740

        Person tim = new Person("Tim");
        System.out.println(tim.hashCode()); // 840880

        // Тестирование переопределения equals()
        Point point1 = new Point(10, 15);
        Point point2 = point1;

        boolean result = point1.equals(point2);
        System.out.println(result);    // true

        result = point1.equals(new Point(10, 15));
        System.out.println(result);    // true


        result = point1 .equals("hello");
        System.out.println(result);    // false

        result = point1 .equals(null);
        System.out.println(result);    // false
    }
}

class Person {
    private String name;

    Person(String name) {
        this.name = name;
    }

    /**
     * Хэшкод возвращает хэш объекта. Иными словами, некоторое число, рассчитанное на основании значения полей.
     * Метод возвращает int, соответственно, количество уникальных значений хэшкода ограничено и он может совпадать у
     * различных по значениям полей объектов. Совпадение хэшей (хэшкодов) при разных входных данных называется
     * коллизией.
     * Поведение по умолчанию у hashCode() зависит от настроек JVM. В любом случае, если мы хотим его использовать
     * (например, hashCode() используется во многих коллекциях), мы обязаны его переопределить.
     * Число 31 (или большее) используется для того, чтобы сделать хэш более разнообразным и неповторяющимся ввиду
     * ограничения длины переменной типа int
     * Алгоритмы расчета хэшкода могут отличаться, это не критично на данном этапе. В рамках этого алгоритма мы
     * можем увидеть умножение на 31. Оно необходимо для более равномерного распределения значений по множеству int.
     *
     * При выборе полей для расчета hashCode() необходимо брать те же поля, что и для equals(). Подробнее ниже.
     */
    @Override
    public int hashCode() {
        int hash = 0;
        for (int i = 0; i < name.length(); i++)
            hash = 31 * hash + name.charAt(i);
        return hash;
    }
}

class Point {

    private int x;
    private int y;

    Point(int x, int y) {

        this.x = x;
        this.y = y;
    }

    void print() {
        System.out.printf("(%d, %d)", x, y);
    }

    /**
     * Чтобы использовать equals() для настоящего сравнения объектов, его необходимо переопределить.
     * Правила переопределения основаны на контракте equals() — договоренности, какое поведение ожидается от этого
     * метода.
     * Контракт определяет следующие характеристики:
     * 1. Рефлексивность. Иными словами, x.equals(x) == true;
     * 2. Симметричность: если x.equals(y), то и y.equals(x);
     * 3. Переносимость: если x.equals(y) и y.equals(z), то и x.equals(z);
     * 4. Консистентность: повторное выполнение x.equals(y) без изменения состояния (полей) объектов x и y должно
     * возвращать один и тот же результат;
     * 5. Сравнение с NULL: x.equals(null) == false.
     */
    @Override
    public boolean equals(Object o) {
        if (this == o) { //Гарантируем рефлексивность
            return true;
        }
        if (o == null) {
            return false;
        }
        if (!getClass().equals(o.getClass())) { // Возможны вариации.
            // Использование instanceof или сравнение типа параметра с явно вызванным
            // литералом класса: o.getClass().equals(SthClass.class)
            return false;
        }
        Point point = (Point) o;   // К этой строке мы уже уверены, что тип верный и можно кастить.
        // При использовании instanceof это можно описать немного лакончинее

        // Ниже будет сравнение по полям. Если значение по всем проверяемым полям совпадают возвращаем из метода true,
        // если хоть в одном поле значения отличаются - false
        return x == point.x && y == point.y;
    }
}